; domain
(define (domain healthcare)

(:requirements :strips :typing :negative-preconditions :existential-preconditions :disjunctive-preconditions :conditional-effects)

(:types
	location
	unit - locatable
	content - locatable
	box - locatable
	patient - locatable
	robot-box - robot
	robot-patient - robot
	robot - locatable
	carrier - locatable
	capacity_number - object
)

(:constants 
	central_warehouse - location
	entrance - location
	scalpel tongue_depressor aspirin bandage thermometer - content
)

(:predicates
	(at ?x - locatable ?l - location)		; x is at location
	(at-unit ?p - patient ?u - unit) 		; patient is at unit

	(filled-with ?b - box ?c - content) 		; box is filled with content 
	(empty-box ?b - box)               			; box is empty
	
	(unit-has-content ?u - unit ?c - content) ; unit has specific content
	(unit-has-box ?u - unit ?b - box)              ; unit has a box
	
	(loaded ?c - carrier ?b - box)          ; carrier is carrying a box
	; (unloaded ?r - robot-box)               	; robot is empty

	(capacity ?c - carrier ?n - capacity_number)
	(capacity_predecessor ?arg0 - capacity_number ?arg1 - capacity_number)

	(rob-carrier ?r - robot-box ?c - carrier)          ; robot has a carrier

	(with-patient ?r - robot ?p - patient)     ; robot is with a patient
	(busy ?r - robot-patient)               					; robot is busy with a patient

	(connected ?l1 - location ?l2 - location) ; locations are connected
)


; (:functions
; 	(max_load_capacity ?c - carrier) - number ; max load capacity of a carrier
; 	(num_box_carried ?c - carrier) - number ; box carried by a carrier
; )

;define actions here
(:action fill
	:parameters (?r - robot-box ?b - box ?c - content ?l - location)
	:precondition (and 
		(at ?b ?l)
		(at ?r ?l)
		(at ?c ?l)
		(empty-box ?b)
	)
	:effect (and 
		(filled-with ?b ?c)
		(not (empty-box ?b))
	)
)

(:action empty
	:parameters (?r - robot-box ?b - box ?c - content ?u - unit ?l - location)
	:precondition (and 
		(at ?u ?l)
		(at ?b ?l)
		(at ?r ?l)
		(unit-has-box ?u ?b)
		(filled-with ?b ?c)
		(not (empty-box ?b))
		(not (unit-has-content ?u ?c))
	)
	:effect (and 
		(unit-has-content ?u ?c)
		(not (filled-with ?b ?c))
		(empty-box ?b)
		(at ?c ?l)
	)
)

(:action pick-up
	:parameters (?r - robot-box ?b - box ?l - location ?c - carrier ?s1 - capacity_number ?s2 - capacity_number)
	:precondition (and 
		(at ?b ?l)
		(at ?r ?l)
		(at ?c ?l)
		(rob-carrier ?r ?c)
		(capacity_predecessor ?s1 ?s2)
		(capacity ?c ?s2)
	)
	:effect (and 
		(loaded ?c ?b)
		(not (at ?b ?l))
		(capacity ?c ?s1)
		(not (capacity ?c ?s2))
	)
)

(:action move
	:parameters (?r - robot ?from - location ?to - location)
	:precondition (and 
		(at ?r ?from)
		(or (connected ?from ?to) (connected ?to ?from))
		(not (= ?to central_warehouse))
	)
	:effect (and 
		(at ?r ?to)
		(not (at ?r ?from))

		(forall (?c - carrier) 
			(when (rob-carrier ?r ?c) 
				(and (at ?c ?to)
					(not (at ?c ?from))
				)
			)
		)

		(forall (?b - box) 
			(when (loaded ?r ?b) 
				(and (at ?b ?to)
					(not (at ?b ?from))
				)
			)
		)

		(forall (?p - patient) 
			(when (with-patient ?r ?p) 
				(and (at ?p ?to)
					(not (at ?p ?from))
				)
			)
		)
	)
)


(:action drop
		:parameters (?r - robot-box ?b - box ?l - location ?u - unit ?c - carrier ?s1 - capacity_number ?s2 - capacity_number)
		:precondition (and
			(at ?r ?l)
			(at ?u ?l)
			(at ?c ?l)
			(rob-carrier ?r ?c)
			(loaded ?c ?b)
			(capacity_predecessor ?s1 ?s2)
			(capacity ?c ?s1)
		)
		:effect (and 
			(unit-has-box ?u ?b)
			(at ?b ?l)
			(not (loaded ?c ?b))
			(capacity ?c ?s2)
			(not (capacity ?c ?s1))
		)
)

(:action take-patient
	:parameters (?r - robot-patient ?p - patient ?l - location)
	:precondition (and 
		(at ?r ?l)
		(at ?p ?l)
		(not (busy ?r))
	)
	:effect (and 
		(with-patient ?r ?p)
		(busy ?r)
	)
)

(:action release-patient
	:parameters (?r - robot-patient ?p - patient ?l - location ?u - unit)
	:precondition (and 
		(at ?r ?l)
		(at ?p ?l)
		(at ?u ?l)
		(with-patient ?r ?p)
		(busy ?r)
	)

	:effect (and 
		(not (with-patient ?r ?p))
		(not (busy ?r))
		(at-unit ?p ?u)
	)
)

(:action return-to-warehouse
	:parameters (?r - robot-box ?from - location ?c - carrier ?s - capacity_number)
	:precondition (and 
		(at ?r ?from)
		(at ?c ?from)
		(rob-carrier ?r ?c)
		(not (exists (?s0 - capacity_number) (capacity_predecessor ?s0 ?s)))
		(or (connected ?from central_warehouse) (connected central_warehouse ?from))
		(not (at ?r central_warehouse))
	)
	:effect (and 
		(at ?r central_warehouse)
		(not (at ?r ?from))
		(at ?c central_warehouse)
		(not (at ?c ?from))
	)
)
)

; problem
(define (problem problem2) (:domain healthcare)
(:objects 
    r1 - robot-box
    r2 - robot-patient
    
    b1 b2 b3 - box

    u1 u2 u3 - unit
    l1 l2 l3 - location

    p1 p2 - patient

    c1 - carrier

    capacity_0 - capacity_number
	capacity_1 - capacity_number
    capacity_2 - capacity_number
    capacity_3 - capacity_number
)

(:init
    (at b1 central_warehouse)
    (at b2 central_warehouse)
    (at b3 central_warehouse)

    (empty-box b1)
    (empty-box b2)
    (empty-box b3)

    (at scalpel central_warehouse)
    (at tongue_depressor central_warehouse)
    (at aspirin central_warehouse)
    (at bandage central_warehouse)
    (at thermometer central_warehouse)

    (at u1 l1)
    (at u2 l2)
    (at u3 l3)

    (at r1 central_warehouse)
    (at r2 entrance)

    ; (unloaded r1)

    (at p1 entrance)
    (at p2 entrance)
    
    (connected central_warehouse entrance)
    (connected entrance l1)
    (connected entrance l2)
    (connected entrance l3)
    (connected central_warehouse l1)
    (connected central_warehouse l2)
    (connected central_warehouse l3)
    (connected l1 l2)
    (connected l1 l3)
    (connected l2 l3)

    ; ---- carrier ----

    (at c1 central_warehouse)
    (rob-carrier r1 c1)
    ; (= (max_load_capacity c1) 2)
    ; (= (num_box_carried c1) 0)
    (capacity_predecessor capacity_0 capacity_1)
    (capacity_predecessor capacity_1 capacity_2)
    (capacity_predecessor capacity_2 capacity_3)
    (capacity c1 capacity_2)
)

(:goal (and
    ;todo: put the goal condition here
    (unit-has-content u1 scalpel)
    (unit-has-content u1 bandage)
    (unit-has-content u2 thermometer)

    ; (patient-at p1 l1)
    ; (patient-at p2 l2)

    (at-unit p1 u1)
    (at-unit p2 u2)
))

;un-comment the following line if metric is needed
(:metric minimize (total-cost))
)

; plan
1. (take-patient r2 p1 entrance)
   added: (with-patient r2 p1) (busy r2)
   goals met: 0 of 5
2. (move r2 entrance l1)
   deleted: (at r2 entrance) (at p1 entrance)
   added: (at r2 l1) (at p1 l1)
   goals met: 0 of 5
3. (release-patient r2 p1 l1 u1)
   deleted: (with-patient r2 p1) (busy r2)
   added: (at-unit p1 u1)
   goals met: 1 of 5
4. (move r2 l1 entrance)
   deleted: (at r2 l1)
   added: (at r2 entrance)
   goals met: 1 of 5
5. (take-patient r2 p2 entrance)
   added: (with-patient r2 p2) (busy r2)
   goals met: 1 of 5
6. (move r2 entrance l2)
   deleted: (at r2 entrance) (at p2 entrance)
   added: (at r2 l2) (at p2 l2)
   goals met: 1 of 5
7. (release-patient r2 p2 l2 u2)
   deleted: (with-patient r2 p2) (busy r2)
   added: (at-unit p2 u2)
   goals met: 2 of 5
8. (fill r1 b3 thermometer central_warehouse)
   deleted: (empty-box b3)
   added: (filled-with b3 thermometer)
   goals met: 2 of 5
9. (pick-up r1 b3 central_warehouse c1 capacity_1 capacity_2)
   deleted: (at b3 central_warehouse) (capacity c1 capacity_2)
   added: (loaded c1 b3) (capacity c1 capacity_1)
   goals met: 2 of 5
10. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse) (at c1 central_warehouse)
   added: (at r1 l2) (at c1 l2)
   goals met: 2 of 5
11. (drop r1 b3 l2 u2 c1 capacity_1 capacity_2)
   deleted: (loaded c1 b3) (capacity c1 capacity_1)
   added: (unit-has-box u2 b3) (at b3 l2) (capacity c1 capacity_2)
   goals met: 2 of 5
12. (empty r1 b3 thermometer u2 l2)
   deleted: (filled-with b3 thermometer)
   added: (unit-has-content u2 thermometer) (empty-box b3) (at thermometer l2)
   goals met: 3 of 5
13. (move r1 l2 l1)
   deleted: (at r1 l2) (at c1 l2)
   added: (at r1 l1) (at c1 l1)
   goals met: 3 of 5
14. (return-to-warehouse r1 l1 c1 capacity_0)
   deleted: (at r1 l1) (at c1 l1)
   added: (at r1 central_warehouse) (at c1 central_warehouse)
   goals met: 3 of 5
15. (fill r1 b2 bandage central_warehouse)
   deleted: (empty-box b2)
   added: (filled-with b2 bandage)
   goals met: 3 of 5
16. (pick-up r1 b2 central_warehouse c1 capacity_1 capacity_2)
   deleted: (at b2 central_warehouse) (capacity c1 capacity_2)
   added: (loaded c1 b2) (capacity c1 capacity_1)
   goals met: 3 of 5
17. (move r1 central_warehouse l1)
   deleted: (at r1 central_warehouse) (at c1 central_warehouse)
   added: (at r1 l1) (at c1 l1)
   goals met: 3 of 5
18. (drop r1 b2 l1 u1 c1 capacity_1 capacity_2)
   deleted: (loaded c1 b2) (capacity c1 capacity_1)
   added: (unit-has-box u1 b2) (at b2 l1) (capacity c1 capacity_2)
   goals met: 3 of 5
19. (empty r1 b2 bandage u1 l1)
   deleted: (filled-with b2 bandage)
   added: (unit-has-content u1 bandage) (empty-box b2) (at bandage l1)
   goals met: 4 of 5
20. (return-to-warehouse r1 l1 c1 capacity_0)
   deleted: (at r1 l1) (at c1 l1)
   added: (at r1 central_warehouse) (at c1 central_warehouse)
   goals met: 4 of 5
21. (fill r1 b1 scalpel central_warehouse)
   deleted: (empty-box b1)
   added: (filled-with b1 scalpel)
   goals met: 4 of 5
22. (pick-up r1 b1 central_warehouse c1 capacity_1 capacity_2)
   deleted: (at b1 central_warehouse) (capacity c1 capacity_2)
   added: (loaded c1 b1) (capacity c1 capacity_1)
   goals met: 4 of 5
23. (move r1 central_warehouse l1)
   deleted: (at r1 central_warehouse) (at c1 central_warehouse)
   added: (at r1 l1) (at c1 l1)
   goals met: 4 of 5
24. (drop r1 b1 l1 u1 c1 capacity_1 capacity_2)
   deleted: (loaded c1 b1) (capacity c1 capacity_1)
   added: (unit-has-box u1 b1) (at b1 l1) (capacity c1 capacity_2)
   goals met: 4 of 5
25. (empty r1 b1 scalpel u1 l1)
   deleted: (filled-with b1 scalpel)
   added: (unit-has-content u1 scalpel) (empty-box b1) (at scalpel l1)
   goals met: 5 of 5
